Repository: DivineStudio/com.DaltonPonder.sa
Catalog: com.DaltonPonder.sa/Shared/Resources/Resource.*.resx
Languages: es

# SelectUICultureComponent.ButtonText
source: English
es: Español

# MainLayout.ConnectWithMe
source: Connect With Me
es: Conecta Conmigo

# MainLayout.GitHubTitle
source: GitHub Account Link
es: Enlace de cuenta de GitHub

# MainLayout.LinkedInTitle
source: LinkedIn Account Link
es: Enlace de cuenta de LinkedIn

# Home.Title
source: Welcome | DaltonPonder.com
es: Bienvenido | DaltonPonder.com

# Home.WelcomeMessage
source: Welcome!
es: ¡Bienvenido!

# SelectUICultureComponent.ButtonTitle
source: Switch to Spanish
es: Cambiar al inglés

# Images.DaltonPonderAltText
source: Professional Photo of Dalton Ponder
es: Imagen profesional de Dalton Ponder

# Home.HeroMessage1
source: Web Developer.
es: Desarrollador Web.

# Home.HeroMessage3
source: Sitefinity Dev.
es: Desarrollador Sitefinity.

# Home.IAmDaltonPonder
source: I am Dalton Ponder.
es: Me llamo Dalton Ponder.

# Home.Introduction
source: With a passion for collaboration and a friendly demeanor, I thrive on helping others and working seamlessly within a team. My educational journey led me to achieve a bachelor's degree in Computer Information Systems from Columbia College, followed by a master’s degree in Cybersecurity and Information Assurance from Western Governor’s University. Complementing my academic prowess, I earned the esteemed Certified Ethical Hacker certificate from the EC-Council.
es: Con una pasión por la colaboración y un comportamiento amistoso, me encanta ayudar a los demás y trabajar sin problemas dentro de un equipo. Mi trayectoria educativa me llevó a obtener una licenciatura en Sistemas Informáticos por el Columbia College, seguida de un máster en Ciberseguridad y Garantía de la Información por la Western Governor's University. Como complemento a mis proezas académicas, obtuve el prestigioso certificado Certified Ethical Hacker de EC-Council.

# Home.Introduction2
source: Currently, I contribute my expertise as a Web Developer at Smooth Fusion in Lubbock, TX. Specializing in Progress Sitefinity Content Management System (CMS) solutions, I bring a wealth of knowledge and a dedication to creating innovative and secure web solutions for clients. My commitment to excellence extends beyond the code, as I continue to foster a collaborative and supportive work environment for the entire team.
es: Actualmente, contribuyo con mi experiencia como Desarrollador Web en Smooth Fusion en Lubbock, TX. Especializado en soluciones Progress Sitefinity Content Management System (CMS), aporto una gran cantidad de conocimientos y una dedicación a la creación de soluciones web innovadoras y seguras para los clientes. Mi compromiso con la excelencia se extiende más allá del código, ya que sigo fomentando un ambiente de trabajo colaborativo y de apoyo para todo el equipo.

# Home.EducationHeader
source: Education
es: Educación

# Home.CertificationsHeader
source: Certifications
es: Certificaciones

# Home.GetToKnowMeHeader
source: Get To Know Me.
es: Conózcame.

# Home.GetToKnowMe1
source: Beyond my professional pursuits, I find fulfillment and balance in a diverse array of hobbies and interests. My paramount joy lies in spending quality time with my family, cherishing moments that create lasting bonds and memories. Immersed in the transformative power of music, I often find solace in its melodies, enriching my days with a soundtrack that resonates with my spirit.
es: Más allá de mis actividades profesionales, encuentro satisfacción y equilibrio en una amplia gama de aficiones e intereses. Mi mayor alegría es pasar tiempo de calidad con mi familia, apreciando los momentos que crean vínculos y recuerdos duraderos. Inmersa en el poder transformador de la música, a menudo encuentro consuelo en sus melodías, enriqueciendo mis días con una banda sonora que resuena con mi espíritu.

# Home.GetToKnowMe2
source: As a tech enthusiast, I indulge in the world of computer games, navigating virtual realms that challenge and captivate my mind. Outside the digital sphere, I channel my energy into the disciplined art of boxing, a physical endeavor that not only keeps me fit but instills a sense of focus and determination.
es: Como entusiasta de la tecnología, me entrego al mundo de los juegos de ordenador, navegando por reinos virtuales que desafían y cautivan mi mente. Fuera de la esfera digital, canalizo mi energía en el disciplinado arte del boxeo, una actividad física que no sólo me mantiene en forma, sino que me infunde concentración y determinación.

# Home.GetToKnowMe3
source: In my continuous quest for personal development, I am dedicated to learning Spanish, opening doors to cultural understanding and global connections. Exploring the philosophical depths, I engage in the study of Stoicism, embracing its timeless principles for resilience and tranquility.
es: En mi continua búsqueda del desarrollo personal, me dedico a aprender español, abriendo puertas a la comprensión cultural y a las conexiones globales. Explorando las profundidades filosóficas, me dedico al estudio del estoicismo, abrazando sus principios atemporales para la resiliencia y la tranquilidad.

# Home.GetToKnowMe4
source: Finally, amidst the ebb and flow of life, I find solace in the written word. Reading, for me, is not just a pastime but a journey into different worlds, ideas, and perspectives. These diverse interests weave a tapestry that shapes my character, fostering a well-rounded and engaged approach to both personal and professional spheres.
es: Por último, en medio del flujo y reflujo de la vida, encuentro consuelo en la palabra escrita. Para mí, la lectura no es sólo un pasatiempo, sino un viaje a mundos, ideas y perspectivas diferentes. Estos diversos intereses tejen un tapiz que da forma a mi carácter, fomentando un enfoque completo y comprometido de las esferas personal y profesional.
